Revit 2024 API
ViewSet.Erase Method
Removes a specified view from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	View item
)
Visual Basic
Public Overridable Function Erase ( _
	item As View _
) As Integer
Visual C++
public:
virtual int Erase(
	View^ item
)
Parameters
item
Type: Autodesk.Revit.DB.View
The view to be erased.
Return Value
The number of views that were erased from the set.
See Also
ViewSet Class
Autodesk.Revit.DB Namespace